'''
Задача 1
В модуль с проверкой даты  добавьте возможность запуска в терминале с передачей даты на проверку. .
'''

from Lection_6.Homework_6.module_task_2 import calend, calend_terminal


if __name__ == '__main__':
    print(calend('30.12.2018'))
    calend_terminal()
