'''
Задача 1
В модуль с проверкой даты  добавьте возможность запуска в терминале с передачей даты на проверку. .
'''

from Lection_6.Home_task_1.package_task_8.module_task_7 import calend, calend_terminal


if __name__ == '__main__':
    print(calend('30.12.2018'))
    calend_terminal()
